## Merge

Pandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects

In [4]:
import pandas as pd

df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
    
})

display(df1)

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [5]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
display(df2)

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

### Merge DataFrames on Key

In [7]:
df3 = pd.merge(df1, df2, on="city")
display(df3)

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

Inner join is pandas default merge

### Left Join

Keep every row in the left dataframe. Where there are missing values of the “on” variable in the right dataframe, add empty / NaN values in the result.

In [8]:
df3 = pd.merge(df1, df2, on="city", how="left")

In [9]:
display(df3)

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

### Right Join

To perform the right merge, we just repeat the code above by simply changing the parameter of left to right

In [10]:
df3 = pd.merge(df1, df2, on="city", how="right")

In [11]:
display(df3)

        city  temperature  humidity
0   new york         21.0        68
1    chicago         14.0        65
2  san diego          NaN        71

### Inner Join

Pandas uses “inner” merge by default. This keeps only the common values in both the left and right dataframes for the merged data

In [12]:
df3 = pd.merge(df1, df2, on="city", how="inner")
display(df3)

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

### Outer Join

The “outer” merge combines all the rows for left and right dataframes with NaN when there are no matched values in the rows

In [13]:
df3 = pd.merge(df1, df2, on="city", how="outer")
display(df3)

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

### Group by

pandas.DataFrame.groupby, A groupby operation involves some combination of splitting the object, applying a function, and combining the results. This can be used to group large amounts of data and compute operations on these groups

In [15]:
import numpy as np
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.],
                   'C' : np.random.randn(4),
                   'D' : np.random.randn(4)})

In [16]:
display(df)

   Animal  Max Speed         C         D
0  Falcon      380.0 -0.276325 -0.697264
1  Falcon      370.0 -0.215184  1.270383
2  Parrot       24.0  0.876114  1.034781
3  Parrot       26.0  0.067161  0.181749

On a DataFrame, we obtain a GroupBy object by calling groupby(). We could naturally group by either the Animal or Max Speed columns, or both

In [18]:
grouped = df.groupby(['Animal'])
display(grouped)

In [19]:
grouped = df.groupby(['Animal', 'Max Speed'])
display(grouped)

It returns the DataFrame groupby object, but the actual computation starts with the aggregation

In [20]:
grouped = df.groupby(['Animal']).mean()
display(grouped)

        Max Speed         C         D
Animal
Falcon      375.0 -0.245754  0.286560
Parrot       25.0  0.471638  0.608265

### Column Indexing

The GroupBy object supports column indexing in the same way as the DataFrame, and returns a modified GroupBy object

In [21]:
grouped = df.groupby(['Animal'])['Max Speed'].mean()
display(grouped)

Animal
Falcon    375.0
Parrot     25.0
Name: Max Speed, dtype: float64

### Aggregate

The preceding discussion focused on aggregation for the combine operation, but there are more options available. In particular, GroupBy objects have aggregate()

In [22]:
grouped = df.groupby(['Animal'])['Max Speed'].aggregate([min, np.mean, max])
display(grouped)

          min   mean    max
Animal
Falcon  370.0  375.0  380.0
Parrot   24.0   25.0   26.0

### Pivot Table

pandas.pivot_table create a spreadsheet-style pivot table as a DataFrame. The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame

In [23]:
df = pd.DataFrame({'Name': ['John', 'Boby', 'Mina', 'Peter', 'Nicky'], 
      'Degree': ['Masters', 'Graduate', 'Graduate', 'Masters', 'Graduate'], 
      'Score': [27, 23, 21, 23, 24]})
display(df)

    Name    Degree  Score
0   John   Masters     27
1   Boby  Graduate     23
2   Mina  Graduate     21
3  Peter   Masters     23
4  Nicky  Graduate     24

In [24]:
pd.pivot_table(df, index='Name', values='Score')

       Score
Name
Boby      23
John      27
Mina      21
Nicky     24
Peter     23

By passing Year as the index parameter, we chose to group our data by Name

### Creating Multi Index Pivot Table

In [26]:
pd.pivot_table(df, index=['Name', 'Degree'], values=['Score'])

                Score
Name  Degree
Boby  Graduate     23
John  Masters      27
Mina  Graduate     21
Nicky Graduate     24
Peter Masters      23